# Task 1: Data Loading and Preprocessing

### 1. Loading the dataset from the given CSV file into a Pandas Data Frame

In [1]:
import pandas as pd

#1: Loading the data into pandas data frame
df = pd.read_csv("../data/Dataset.csv")
df.head()

   Sno     job  education  gender English speaker
0    1  manage         15    male              no
1    2   admin         16    male              no
2    3   admin         12  female              no
3    4   admin          8  female              no
4    5   admin         15    male              no

###  2. Basic data preprocessing steps, including handling missing values and removing duplicate rows.

In [3]:
#check fataset for the number of rows and columns
df.shape

(474, 5)

In [4]:
#Check the tendencies of data
df.describe(include = 'all')

               Sno    job   education gender English speaker
count   474.000000    474  474.000000    474             474
unique         NaN      3         NaN      2               2
top            NaN  admin         NaN   male              no
freq           NaN    363         NaN    258             370
mean    237.500000    NaN   13.491561    NaN             NaN
std     136.976275    NaN    2.884846    NaN             NaN
min       1.000000    NaN    8.000000    NaN             NaN
25%     119.250000    NaN   12.000000    NaN             NaN
50%     237.500000    NaN   12.000000    NaN             NaN
75%     355.750000    NaN   15.000000    NaN             NaN
max     474.000000    NaN   21.000000    NaN             NaN

In [5]:
#identifying categorical and numerical columns inside the dataset

catagorical_cols = df.columns[(df.dtypes == "object").tolist()].tolist()
numerical_cols = df.columns[(df.dtypes != 'object').tolist()].tolist()

In [6]:
#identifying the total missing values
missing_values = df.isnull().sum()
missing_values

Sno                0
job                0
education          0
gender             0
English speaker    0
dtype: int64

In [7]:
#identifying the columns with missing values

missing_values_cols = missing_values[missing_values > 0].axes[0].tolist()
missing_values_cols

[]

In [8]:
#Checking Null values for each column

df.loc[df['job'].isnull()]
df.loc[df['education'].isnull()]
df.loc[df['gender'].isnull()]
df.loc[df['English speaker'].isnull()]

Empty DataFrame
Columns: [Sno, job, education, gender, English speaker]
Index: []

In [15]:
#Handling missing values
#Replacing missing values with mode
df['job'].fillna(df['job'].mode()[0], inplace = True)
df['education'].fillna(df['education'].mode()[0], inplace = True)
df['English speaker'].fillna(df['English speaker'].mode()[0], inplace = True)


#Checking for duplicate rows and removing them
#checking for duplicate rows
df.duplicated().sum()
#Removing duplicate rows
df.drop_duplicates(inplace = True)

### 3. Display the first few rows of the cleaned dataset.

In [16]:
#Displaying the first 10 rows of the cleaned dataset
df.head(10)

   Sno     job  education  gender English speaker
0    1  manage         15    male              no
1    2   admin         16    male              no
2    3   admin         12  female              no
3    4   admin          8  female              no
4    5   admin         15    male              no
5    6   admin         15    male              no
6    7   admin         15    male              no
7    8   admin         12  female              no
8    9   admin         15  female              no
9   10   admin         12  female              no

# Task 2: Exploratory Data Analysis